NAKSHATRAS = [
    ("அசுவினி", "கேது"),
    ("பரணி", "சுக்கிரன்"),
    ("கார்த்திகை", "சூரியன்"),
    ("ரோகிணி", "சந்திரன்"),
    ("மிருகசீரிடம்", "செவ்வாய்"),
    ("திருவாதிரை", "ராகு"),
    ("புனர்பூசம்", "குரு"),
    ("பூசம்", "சனி"),
    ("ஆயில்யம்", "புதன்"),
    ("மகம்", "கேது"),
    ("பூரம்", "சுக்கிரன்"),
    ("உத்திரம்", "சூரியன்"),
    ("ஹஸ்தம்", "சந்திரன்"),
    ("சித்திரை", "செவ்வாய்"),
    ("சுவாதி", "ராகு"),
    ("விசாகம்", "குரு"),
    ("அனுஷம்", "சனி"),
    ("கேட்டை", "புதன்"),
    ("மூலம்", "கேது"),
    ("பூராடம்", "சுக்கிரன்"),
    ("உத்திராடம்", "சூரியன்"),
    ("திருவோணம்", "சந்திரன்"),
    ("அவிட்டம்", "செவ்வாய்"),
    ("சதயம்", "ராகு"),
    ("பூரட்டாதி", "குரு"),
    ("உத்திரட்டாதி", "சனி"),
    ("ரேவதி", "புதன்"),
]
NAKSHATRA_SIZE = 13.3333333333
PADA_SIZE = NAKSHATRA_SIZE / 4


def get_nakshatra(longitude: float):
    """
    Returns:
        {
            "name": "...",
            "lord": "...",
            "pada": 1-4
        }
    """

    longitude = longitude % 360

    index = int(longitude // NAKSHATRA_SIZE)

    nakshatra_name, lord = NAKSHATRAS[index]

    pada = int((longitude % NAKSHATRA_SIZE) // PADA_SIZE) + 1

    return {
        "name": nakshatra_name,
        "lord": lord,
        "pada": pada
    }